const { SeniverseV3 } = require('seniverse-api')
const setSeniverseApi = new SeniverseV3({
    encryption: {
        uid: 'PhO-St0kgR8oPvLPw', // 公钥
        key: 'SMcZkWoIk_3o4lMX2', // 私钥
        ttl: 100, // 签名失效时间，单位为秒
        enabled: true // 是否进行签名验证
    },
    query: {
        timeouts: [3000, 5000, 7000] // 调用 API 时重试次数以及 timeout 时间，单位为毫秒
    }
})

module.exports = {
    seniverseApi(location) {
        setSeniverseApi.options.query.location = location
        return setSeniverseApi
    },
    // 返回的当前的天气
    codeList: {
        0: '晴（国内城市白天晴）',
        1: '晴（国内城市夜晚晴）',
        2: '晴（国外城市白天晴）',
        3: '晴（国外城市夜晚晴）',
        4: '多云',
        5: '晴间多云',
        6: '晴间多云',
        7: '大部多云',
        8: '大部多云',
        9: '阴',
        10: '阵雨',
        11: '雷阵雨',
        12: '雷阵雨伴有冰雹',
        13: '小雨',
        14: '中雨',
        15: '大雨',
        16: '暴雨',
        17: '大暴雨',
        18: '特大暴雨',
        19: '冻雨',
        20: '雨夹雪',
        21: '阵雪',
        22: '小雪',
        23: '中雪',
        24: '大雪',
        25: '暴雪',
        26: '浮尘',
        27: '扬沙',
        28: '沙尘暴',
        29: '强沙尘暴',
        30: '雾',
        31: '霾',
        32: '风',
        33: '大风',
        34: '飓风',
        35: '热带风暴',
        36: '龙卷风',
        37: '冷',
        38: '热',
        99: '未知'
    },
    // 返回的错误提示
    errorList: {
        AP010001: 'API 请求参数错误',
        AP010002: '没有权限访问这个 API 接口。在此查看你有权访问的 API 接口',
        AP010003: 'API 密钥 key 错误',
        AP010004: '签名错误',
        AP010005: '你请求的 API 不存在',
        AP010006: '没有权限访问这个地点',
        AP010007: 'JSONP 请求需要使用签名验证方式',
        AP010008: '没有绑定域名。请在控制台对应的产品管理下进行域名绑定',
        AP010009: 'API 请求的 user-agent 与你设置的不一致',
        AP010010: '没有这个地点',
        AP010011: '无法查找到指定 IP 地址对应的城市',
        AP010012: '你的服务已经过期。在此续费',
        AP010013: '访问量余额不足。在此购买',
        AP010014: '访问频率超过限制',
        AP010015: '暂不支持该城市的车辆限行信息',
        AP010016: '暂不支持该城市的潮汐数据',
        AP010017: '请求的坐标超出支持的范围',
        AP100001: '系统内部错误：数据缺失',
        AP100002: '系统内部错误：数据错误',
        AP100003: '系统内部错误：服务内部错误',
        AP100004: '系统内部错误：网关错误'
    }
}
